import os
import urllib
from bs4 import BeautifulSoup
from fontTools.ttLib import TTFont
import requests
import time
import numpy as pd
import pandas as pd
from pandas import DataFrame



'''
df = pd.DataFrame(pd.read_excel( './data/beijing/beijing.xlsx',sheet_name ='大众点评餐厅信息'))
shopURL = df['shopURL']
#df['Tele']= None
#df.insert(3,'Tele',None)
for i in range(0,5):
    df.iloc[i,3] = 1
DataFrame(df).to_excel('./data/beijing/beijing.xlsx',sheet_name ='大众点评餐厅信息',index=False, header=True)
'''

def get_Shopdetails(font_name_tel,font_name_time,font_name_dish):
    #获取已爬取的shopurl
    df = pd.DataFrame(pd.read_excel('./data/beijing/beijing.xlsx', sheet_name='大众点评餐厅信息'))
    shopURL = df['shopURL']
    shopid_list = df['shop_id']
    #修改插入值
    df.insert(3, 'Tele', None)
    df.insert(4, 'Time', None)
    for i in range(len(shopURL)):
        time.sleep(40)
        url = shopURL[i]
        shopid = shopid_list[i]
        headers = {
            'Accept': 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9',
            'Accept-Encoding': 'gzip, deflate',
            'Accept-Language': 'zh-CN,zh;q=0.9',
            'Connection': 'keep-alive',
            "Cookie": 's_ViewType=10; _lxsdk_cuid=16fa87fc490c8-02426df1c4ac71-6701b35-144000-16fa87fc491c8; _lxsdk=16fa87fc490c8-02426df1c4ac71-6701b35-144000-16fa87fc491c8; _hc.v=e341e466-9834-a0f5-107b-9fdab1b34191.1579079944; ua=Daisy._620; ctu=d465b1dcc3f659856cf30445bbdb5b7325f916625944c0eda4a4e09ab5c3dc95; cityid=341; switchcityflashtoast=1; default_ab=index%3AA%3A3%7CshopList%3AC%3A5; dplet=63b9a755291eec6e054067fdf1d6842b; dper=7c5d01df3117bf3d570e5b81af787981fa361e78dc792a941622ce17921ba5378670a472fa2c5b2fac712fff4394b541a9c5ef1545188b7744a47cd0139069c27d09701ca681e46e40e04145b54eb0c46981b154f3182aaadacc9c5c52e20048; _lx_utm=utm_source%3DBaidu%26utm_medium%3Dorganic; cy=2; cye=beijing; ll=7fd06e815b796be3df069dec7836c3df; _lxsdk_s=171073f9ee5-65f-7a7-038%7C%7C282',
            'Host': 'www.dianping.com',
            'If-Modified-Since': 'Mon, 23 Mar 2020 05:11:12 GMT',
            'If-None-Match': "6d7f33e3ecead2ca33bd5e1d99b0f990",
            'Referer': 'http://www.dianping.com/beijing/ch10',
            'Upgrade-Insecure-Requests': '1',
            'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/80.0.3987.149 Safari/537.36'
        }
        html = requests.get(url, headers = headers).text

        #对加密文本进行解码
        for code, value in font_name_tel.items():
            code_str = code
            text = value
            # 再在html文本中进行对比，如果文本中的编码字符与字典中的解码字符一致，就进行替换
            if code_str in html:
                html = html.replace(code_str, text)

        for code, value in font_name_hour.items():
            code_str = code
            text = value
            # 再在html文本中进行对比，如果文本中的编码字符与字典中的解码字符一致，就进行替换
            if code_str in html:
                html = html.replace(code_str, text)

        for code, value in font_name_dish.items():
            code_str = code
            text = value
            # 再在html文本中进行对比，如果文本中的编码字符与字典中的解码字符一致，就进行替换
            if code_str in html:
                html = html.replace(code_str, text)
            '''
        #创建餐厅文件，存储推荐菜名称、图片
        shop_path = "./data/beijing/" + str(shopid) + '/'
        if not os.path.exists(shop_path):
            os.makedirs(shop_path)
        dish_img = shop_path + '/' + 'Re-dish' + '/'
        if not os.path.exists(dish_img):
            os.makedirs(dish_img)

        #创建CSV文件，存储推荐菜名称
        re_dish_File = open(shop_path +'/dishname.csv','w+')
        '''
        try:
            #对网页进行解析，提取需要的数据
            bs = BeautifulSoup(html, 'lxml')
            basic_info = bs.find('div', class_='main')
            tel = basic_info.find('p', class_= 'expand-info tel').get_text()
            print(tel)
            btime = basic_info.find('p', class_='info info-indent').find('span',class_='item').get_text()
            print(btime)
            df.iloc[i, 3] = tel
            df.iloc[i,4] = btime

            #推荐菜

            Re_img = basic_info.find('ul', class_='recommend-photo clearfix').find('img').get('src')


            '''
            for f in range(len(Re_dish_name)):
                urllib.request.urlretrieve(Re_img_url[f], r'./' +  shopid +'%s.jpd' % Re_dish_name[f])
                print(Re_dish_name,Re_img_url)
            
            writer = csv.writer(re_dish_File)
            for f in range(len(Re_dish_name)):
                writer.writerow(f)
                urllib.request.urlretrieve(Re_img_url[f], r'./' + dish_img + '%s.jpd' % Re_dish_name[f])

            re_dish_File.close()
        
            '''
            #营业时间
        except:
            continue

    DataFrame(df).to_excel('./data/beijing/beijing.xlsx',sheet_name ='大众点评餐厅信息',index=False, header=True)


def get_fonttel():
    font_t = TTFont('./woff/b24aae10.woff')
    font_names_t = font_t.getGlyphOrder()
    text_t = ['', '', '1', '2', '3', '4', '5', '6', '7', '8',
               '9', '0', '店', '中', '美', '家', '馆', '小', '车', '大',
               '市', '公', '酒', '行', '国', '品', '发', '电', '金', '心',
               '业', '商', '司', '超', '生', '装', '园', '场', '食', '有',
               '新', '限', '天', '面', '工', '服', '海', '华', '水', '房',
               '饰', '城', '乐', '汽', '香', '部', '利', '子', '老', '艺',
               '花', '专', '东', '肉', '菜', '学', '福', '饭', '人', '百',
               '餐', '茶', '务', '通', '味', '所', '山', '区', '门', '药',
               '银', '农', '龙', '停', '尚', '安', '广', '鑫', '一', '容',
               '动', '南', '具', '源', '兴', '鲜', '记', '时', '机', '烤',
               '文', '康', '信', '果', '阳', '理', '锅', '宝', '达', '地',
               '儿', '衣', '特', '产', '西', '批', '坊', '州', '牛', '佳',
               '化', '五', '米', '修', '爱', '北', '养', '卖', '建', '材',
               '三', '会', '鸡', '室', '红', '站', '德', '王', '光', '名',
               '丽', '油', '院', '堂', '烧', '江', '社', '合', '星', '货',
               '型', '村', '自', '科', '快', '便', '日', '民', '营', '和',
               '活', '童', '明', '器', '烟', '育', '宾', '精', '屋', '经',
               '居', '庄', '石', '顺', '林', '尔', '县', '手', '厅', '销',
               '用', '好', '客', '火', '雅', '盛', '体', '旅', '之', '鞋',
               '辣', '作', '粉', '包', '楼', '校', '鱼', '平', '彩', '上',
               '吧', '保', '永', '万', '物', '教', '吃', '设', '医', '正',
               '造', '丰', '健', '点', '汤', '网', '庆', '技', '斯', '洗',
               '料', '配', '汇', '木', '缘', '加', '麻', '联', '卫', '川',
               '泰', '色', '世', '方', '寓', '风', '幼', '羊', '烫', '来',
               '高', '厂', '兰', '阿', '贝', '皮', '全', '女', '拉', '成',
               '云', '维', '贸', '道', '术', '运', '都', '口', '博', '河',
               '瑞', '宏', '京', '际', '路', '祥', '青', '镇', '厨', '培',
               '力', '惠', '连', '马', '鸿', '钢', '训', '影', '甲', '助',
               '窗', '布', '富', '牌', '头', '四', '多', '妆', '吉', '苑',
               '沙', '恒', '隆', '春', '干', '饼', '氏', '里', '二', '管',
               '诚', '制', '售', '嘉', '长', '轩', '杂', '副', '清', '计',
               '黄', '讯', '太', '鸭', '号', '街', '交', '与', '叉', '附',
               '近', '层', '旁', '对', '巷', '栋', '环', '省', '桥', '湖',
               '段', '乡', '厦', '府', '铺', '内', '侧', '元', '购', '前',
               '幢', '滨', '处', '向', '座', '下', '県', '凤', '港', '开',
               '关', '景', '泉', '塘', '放', '昌', '线', '湾', '政', '步',
               '宁', '解', '白', '田', '町', '溪', '十', '八', '古', '双',
               '胜', '本', '单', '同', '九', '迎', '第', '台', '玉', '锦',
               '底', '后', '七', '斜', '期', '武', '岭', '松', '角', '纪',
               '朝', '峰', '六', '振', '珠', '局', '岗', '洲', '横', '边',
               '济', '井', '办', '汉', '代', '临', '弄', '团', '外', '塔',
               '杨', '铁', '浦', '字', '年', '岛', '陵', '原', '梅', '进',
               '荣', '友', '虹', '央', '桂', '沿', '事', '津', '凯', '莲',
               '丁', '秀', '柳', '集', '紫', '旗', '张', '谷', '的', '是',
               '不', '了', '很', '还', '个', '也', '这', '我', '就', '在',
               '以', '可', '到', '错', '没', '去', '过', '感', '次', '要',
               '比', '觉', '看', '得', '说', '常', '真', '们', '但', '最',
               '喜', '哈', '么', '别', '位', '能', '较', '境', '非', '为',
               '欢', '然', '他', '挺', '着', '价', '那', '意', '种', '想',
               '出', '员', '两', '推', '做', '排', '实', '分', '间', '甜',
               '度', '起', '满', '给', '热', '完', '格', '荐', '喝', '等',
               '其', '再', '几', '只', '现', '朋', '候', '样', '直', '而',
               '买', '于', '般', '豆', '量', '选', '奶', '打', '每', '评',
               '少', '算', '又', '因', '情', '找', '些', '份', '置', '适',
               '什', '蛋', '师', '气', '你', '姐', '棒', '试', '总', '定',
               '啊', '足', '级', '整', '带', '虾', '如', '态', '且', '尝',
               '主', '话', '强', '当', '更', '板', '知', '己', '无', '酸',
               '让', '入', '啦', '式', '笑', '赞', '片', '酱', '差', '像',
               '提', '队', '走', '嫩', '才', '刚', '午', '接', '重', '串',
               '回', '晚', '微', '周', '值', '费', '性', '桌', '拍', '跟',
               '块', '调', '糕'
               ]
    # 然后我们创建一个font_name的字典，用来装字体编码和 --> 所对应的数字、汉字
    font_name_tel = {}
    for index,value in enumerate(text_t):
        # 这就是大众点评乱码的结构：由前面的三个字符‘&#x’+后面是小写字母和数字+分号‘；’
        t = font_names_t[index].replace('uni', '&#x').lower() + ';'
        # 下面生成的这个就是乱码，他就对应刚刚字体文件的对应数字，可以运行看看
        font_name_tel[t] = value

    return font_name_tel

def get_fonttime():
    font_d = TTFont('./woff/45ab0ca2.woff')
    font_names_d = font_d.getGlyphOrder()
    text_d = ['', '', '1', '2', '3', '4', '5', '6', '7', '8',
               '9', '0', '店', '中', '美', '家', '馆', '小', '车', '大',
               '市', '公', '酒', '行', '国', '品', '发', '电', '金', '心',
               '业', '商', '司', '超', '生', '装', '园', '场', '食', '有',
               '新', '限', '天', '面', '工', '服', '海', '华', '水', '房',
               '饰', '城', '乐', '汽', '香', '部', '利', '子', '老', '艺',
               '花', '专', '东', '肉', '菜', '学', '福', '饭', '人', '百',
               '餐', '茶', '务', '通', '味', '所', '山', '区', '门', '药',
               '银', '农', '龙', '停', '尚', '安', '广', '鑫', '一', '容',
               '动', '南', '具', '源', '兴', '鲜', '记', '时', '机', '烤',
               '文', '康', '信', '果', '阳', '理', '锅', '宝', '达', '地',
               '儿', '衣', '特', '产', '西', '批', '坊', '州', '牛', '佳',
               '化', '五', '米', '修', '爱', '北', '养', '卖', '建', '材',
               '三', '会', '鸡', '室', '红', '站', '德', '王', '光', '名',
               '丽', '油', '院', '堂', '烧', '江', '社', '合', '星', '货',
               '型', '村', '自', '科', '快', '便', '日', '民', '营', '和',
               '活', '童', '明', '器', '烟', '育', '宾', '精', '屋', '经',
               '居', '庄', '石', '顺', '林', '尔', '县', '手', '厅', '销',
               '用', '好', '客', '火', '雅', '盛', '体', '旅', '之', '鞋',
               '辣', '作', '粉', '包', '楼', '校', '鱼', '平', '彩', '上',
               '吧', '保', '永', '万', '物', '教', '吃', '设', '医', '正',
               '造', '丰', '健', '点', '汤', '网', '庆', '技', '斯', '洗',
               '料', '配', '汇', '木', '缘', '加', '麻', '联', '卫', '川',
               '泰', '色', '世', '方', '寓', '风', '幼', '羊', '烫', '来',
               '高', '厂', '兰', '阿', '贝', '皮', '全', '女', '拉', '成',
               '云', '维', '贸', '道', '术', '运', '都', '口', '博', '河',
               '瑞', '宏', '京', '际', '路', '祥', '青', '镇', '厨', '培',
               '力', '惠', '连', '马', '鸿', '钢', '训', '影', '甲', '助',
               '窗', '布', '富', '牌', '头', '四', '多', '妆', '吉', '苑',
               '沙', '恒', '隆', '春', '干', '饼', '氏', '里', '二', '管',
               '诚', '制', '售', '嘉', '长', '轩', '杂', '副', '清', '计',
               '黄', '讯', '太', '鸭', '号', '街', '交', '与', '叉', '附',
               '近', '层', '旁', '对', '巷', '栋', '环', '省', '桥', '湖',
               '段', '乡', '厦', '府', '铺', '内', '侧', '元', '购', '前',
               '幢', '滨', '处', '向', '座', '下', '県', '凤', '港', '开',
               '关', '景', '泉', '塘', '放', '昌', '线', '湾', '政', '步',
               '宁', '解', '白', '田', '町', '溪', '十', '八', '古', '双',
               '胜', '本', '单', '同', '九', '迎', '第', '台', '玉', '锦',
               '底', '后', '七', '斜', '期', '武', '岭', '松', '角', '纪',
               '朝', '峰', '六', '振', '珠', '局', '岗', '洲', '横', '边',
               '济', '井', '办', '汉', '代', '临', '弄', '团', '外', '塔',
               '杨', '铁', '浦', '字', '年', '岛', '陵', '原', '梅', '进',
               '荣', '友', '虹', '央', '桂', '沿', '事', '津', '凯', '莲',
               '丁', '秀', '柳', '集', '紫', '旗', '张', '谷', '的', '是',
               '不', '了', '很', '还', '个', '也', '这', '我', '就', '在',
               '以', '可', '到', '错', '没', '去', '过', '感', '次', '要',
               '比', '觉', '看', '得', '说', '常', '真', '们', '但', '最',
               '喜', '哈', '么', '别', '位', '能', '较', '境', '非', '为',
               '欢', '然', '他', '挺', '着', '价', '那', '意', '种', '想',
               '出', '员', '两', '推', '做', '排', '实', '分', '间', '甜',
               '度', '起', '满', '给', '热', '完', '格', '荐', '喝', '等',
               '其', '再', '几', '只', '现', '朋', '候', '样', '直', '而',
               '买', '于', '般', '豆', '量', '选', '奶', '打', '每', '评',
               '少', '算', '又', '因', '情', '找', '些', '份', '置', '适',
               '什', '蛋', '师', '气', '你', '姐', '棒', '试', '总', '定',
               '啊', '足', '级', '整', '带', '虾', '如', '态', '且', '尝',
               '主', '话', '强', '当', '更', '板', '知', '己', '无', '酸',
               '让', '入', '啦', '式', '笑', '赞', '片', '酱', '差', '像',
               '提', '队', '走', '嫩', '才', '刚', '午', '接', '重', '串',
               '回', '晚', '微', '周', '值', '费', '性', '桌', '拍', '跟',
               '块', '调', '糕'
               ]
    # 然后我们创建一个font_name的字典，用来装字体编码和 --> 所对应的数字、汉字
    font_name_time = {}
    for index,value in enumerate(text_d):
        # 这就是大众点评乱码的结构：由前面的三个字符‘&#x’+后面是小写字母和数字+分号‘；’
        t = font_names_d[index].replace('uni', '&#x').lower() + ';'
        # 下面生成的这个就是乱码，他就对应刚刚字体文件的对应数字，可以运行看看
        font_name_time[t] = value

    return font_name_time

def get_fonthour():
    font_h = TTFont('./woff/45ab0ca2.woff')
    font_names_h = font_h.getGlyphOrder()
    text_h = ['', '', '1', '2', '3', '4', '5', '6', '7', '8',
               '9', '0', '店', '中', '美', '家', '馆', '小', '车', '大',
               '市', '公', '酒', '行', '国', '品', '发', '电', '金', '心',
               '业', '商', '司', '超', '生', '装', '园', '场', '食', '有',
               '新', '限', '天', '面', '工', '服', '海', '华', '水', '房',
               '饰', '城', '乐', '汽', '香', '部', '利', '子', '老', '艺',
               '花', '专', '东', '肉', '菜', '学', '福', '饭', '人', '百',
               '餐', '茶', '务', '通', '味', '所', '山', '区', '门', '药',
               '银', '农', '龙', '停', '尚', '安', '广', '鑫', '一', '容',
               '动', '南', '具', '源', '兴', '鲜', '记', '时', '机', '烤',
               '文', '康', '信', '果', '阳', '理', '锅', '宝', '达', '地',
               '儿', '衣', '特', '产', '西', '批', '坊', '州', '牛', '佳',
               '化', '五', '米', '修', '爱', '北', '养', '卖', '建', '材',
               '三', '会', '鸡', '室', '红', '站', '德', '王', '光', '名',
               '丽', '油', '院', '堂', '烧', '江', '社', '合', '星', '货',
               '型', '村', '自', '科', '快', '便', '日', '民', '营', '和',
               '活', '童', '明', '器', '烟', '育', '宾', '精', '屋', '经',
               '居', '庄', '石', '顺', '林', '尔', '县', '手', '厅', '销',
               '用', '好', '客', '火', '雅', '盛', '体', '旅', '之', '鞋',
               '辣', '作', '粉', '包', '楼', '校', '鱼', '平', '彩', '上',
               '吧', '保', '永', '万', '物', '教', '吃', '设', '医', '正',
               '造', '丰', '健', '点', '汤', '网', '庆', '技', '斯', '洗',
               '料', '配', '汇', '木', '缘', '加', '麻', '联', '卫', '川',
               '泰', '色', '世', '方', '寓', '风', '幼', '羊', '烫', '来',
               '高', '厂', '兰', '阿', '贝', '皮', '全', '女', '拉', '成',
               '云', '维', '贸', '道', '术', '运', '都', '口', '博', '河',
               '瑞', '宏', '京', '际', '路', '祥', '青', '镇', '厨', '培',
               '力', '惠', '连', '马', '鸿', '钢', '训', '影', '甲', '助',
               '窗', '布', '富', '牌', '头', '四', '多', '妆', '吉', '苑',
               '沙', '恒', '隆', '春', '干', '饼', '氏', '里', '二', '管',
               '诚', '制', '售', '嘉', '长', '轩', '杂', '副', '清', '计',
               '黄', '讯', '太', '鸭', '号', '街', '交', '与', '叉', '附',
               '近', '层', '旁', '对', '巷', '栋', '环', '省', '桥', '湖',
               '段', '乡', '厦', '府', '铺', '内', '侧', '元', '购', '前',
               '幢', '滨', '处', '向', '座', '下', '県', '凤', '港', '开',
               '关', '景', '泉', '塘', '放', '昌', '线', '湾', '政', '步',
               '宁', '解', '白', '田', '町', '溪', '十', '八', '古', '双',
               '胜', '本', '单', '同', '九', '迎', '第', '台', '玉', '锦',
               '底', '后', '七', '斜', '期', '武', '岭', '松', '角', '纪',
               '朝', '峰', '六', '振', '珠', '局', '岗', '洲', '横', '边',
               '济', '井', '办', '汉', '代', '临', '弄', '团', '外', '塔',
               '杨', '铁', '浦', '字', '年', '岛', '陵', '原', '梅', '进',
               '荣', '友', '虹', '央', '桂', '沿', '事', '津', '凯', '莲',
               '丁', '秀', '柳', '集', '紫', '旗', '张', '谷', '的', '是',
               '不', '了', '很', '还', '个', '也', '这', '我', '就', '在',
               '以', '可', '到', '错', '没', '去', '过', '感', '次', '要',
               '比', '觉', '看', '得', '说', '常', '真', '们', '但', '最',
               '喜', '哈', '么', '别', '位', '能', '较', '境', '非', '为',
               '欢', '然', '他', '挺', '着', '价', '那', '意', '种', '想',
               '出', '员', '两', '推', '做', '排', '实', '分', '间', '甜',
               '度', '起', '满', '给', '热', '完', '格', '荐', '喝', '等',
               '其', '再', '几', '只', '现', '朋', '候', '样', '直', '而',
               '买', '于', '般', '豆', '量', '选', '奶', '打', '每', '评',
               '少', '算', '又', '因', '情', '找', '些', '份', '置', '适',
               '什', '蛋', '师', '气', '你', '姐', '棒', '试', '总', '定',
               '啊', '足', '级', '整', '带', '虾', '如', '态', '且', '尝',
               '主', '话', '强', '当', '更', '板', '知', '己', '无', '酸',
               '让', '入', '啦', '式', '笑', '赞', '片', '酱', '差', '像',
               '提', '队', '走', '嫩', '才', '刚', '午', '接', '重', '串',
               '回', '晚', '微', '周', '值', '费', '性', '桌', '拍', '跟',
               '块', '调', '糕'
               ]
    # 然后我们创建一个font_name的字典，用来装字体编码和 --> 所对应的数字、汉字
    font_name_hour = {}
    for index,value in enumerate(text_h):
        # 这就是大众点评乱码的结构：由前面的三个字符‘&#x’+后面是小写字母和数字+分号‘；’
        h = font_names_h[index].replace('uni', '&#x').lower() + ';'
        # 下面生成的这个就是乱码，他就对应刚刚字体文件的对应数字，可以运行看看
        font_name_hour[h] = value

    return font_name_hour

def get_fontdish():
    font_d = TTFont('./woff/9ff532af.woff')
    font_names_d = font_d.getGlyphOrder()
    text_d = ['', '', '1', '2', '3', '4', '5', '6', '7', '8',
               '9', '0', '店', '中', '美', '家', '馆', '小', '车', '大',
               '市', '公', '酒', '行', '国', '品', '发', '电', '金', '心',
               '业', '商', '司', '超', '生', '装', '园', '场', '食', '有',
               '新', '限', '天', '面', '工', '服', '海', '华', '水', '房',
               '饰', '城', '乐', '汽', '香', '部', '利', '子', '老', '艺',
               '花', '专', '东', '肉', '菜', '学', '福', '饭', '人', '百',
               '餐', '茶', '务', '通', '味', '所', '山', '区', '门', '药',
               '银', '农', '龙', '停', '尚', '安', '广', '鑫', '一', '容',
               '动', '南', '具', '源', '兴', '鲜', '记', '时', '机', '烤',
               '文', '康', '信', '果', '阳', '理', '锅', '宝', '达', '地',
               '儿', '衣', '特', '产', '西', '批', '坊', '州', '牛', '佳',
               '化', '五', '米', '修', '爱', '北', '养', '卖', '建', '材',
               '三', '会', '鸡', '室', '红', '站', '德', '王', '光', '名',
               '丽', '油', '院', '堂', '烧', '江', '社', '合', '星', '货',
               '型', '村', '自', '科', '快', '便', '日', '民', '营', '和',
               '活', '童', '明', '器', '烟', '育', '宾', '精', '屋', '经',
               '居', '庄', '石', '顺', '林', '尔', '县', '手', '厅', '销',
               '用', '好', '客', '火', '雅', '盛', '体', '旅', '之', '鞋',
               '辣', '作', '粉', '包', '楼', '校', '鱼', '平', '彩', '上',
               '吧', '保', '永', '万', '物', '教', '吃', '设', '医', '正',
               '造', '丰', '健', '点', '汤', '网', '庆', '技', '斯', '洗',
               '料', '配', '汇', '木', '缘', '加', '麻', '联', '卫', '川',
               '泰', '色', '世', '方', '寓', '风', '幼', '羊', '烫', '来',
               '高', '厂', '兰', '阿', '贝', '皮', '全', '女', '拉', '成',
               '云', '维', '贸', '道', '术', '运', '都', '口', '博', '河',
               '瑞', '宏', '京', '际', '路', '祥', '青', '镇', '厨', '培',
               '力', '惠', '连', '马', '鸿', '钢', '训', '影', '甲', '助',
               '窗', '布', '富', '牌', '头', '四', '多', '妆', '吉', '苑',
               '沙', '恒', '隆', '春', '干', '饼', '氏', '里', '二', '管',
               '诚', '制', '售', '嘉', '长', '轩', '杂', '副', '清', '计',
               '黄', '讯', '太', '鸭', '号', '街', '交', '与', '叉', '附',
               '近', '层', '旁', '对', '巷', '栋', '环', '省', '桥', '湖',
               '段', '乡', '厦', '府', '铺', '内', '侧', '元', '购', '前',
               '幢', '滨', '处', '向', '座', '下', '県', '凤', '港', '开',
               '关', '景', '泉', '塘', '放', '昌', '线', '湾', '政', '步',
               '宁', '解', '白', '田', '町', '溪', '十', '八', '古', '双',
               '胜', '本', '单', '同', '九', '迎', '第', '台', '玉', '锦',
               '底', '后', '七', '斜', '期', '武', '岭', '松', '角', '纪',
               '朝', '峰', '六', '振', '珠', '局', '岗', '洲', '横', '边',
               '济', '井', '办', '汉', '代', '临', '弄', '团', '外', '塔',
               '杨', '铁', '浦', '字', '年', '岛', '陵', '原', '梅', '进',
               '荣', '友', '虹', '央', '桂', '沿', '事', '津', '凯', '莲',
               '丁', '秀', '柳', '集', '紫', '旗', '张', '谷', '的', '是',
               '不', '了', '很', '还', '个', '也', '这', '我', '就', '在',
               '以', '可', '到', '错', '没', '去', '过', '感', '次', '要',
               '比', '觉', '看', '得', '说', '常', '真', '们', '但', '最',
               '喜', '哈', '么', '别', '位', '能', '较', '境', '非', '为',
               '欢', '然', '他', '挺', '着', '价', '那', '意', '种', '想',
               '出', '员', '两', '推', '做', '排', '实', '分', '间', '甜',
               '度', '起', '满', '给', '热', '完', '格', '荐', '喝', '等',
               '其', '再', '几', '只', '现', '朋', '候', '样', '直', '而',
               '买', '于', '般', '豆', '量', '选', '奶', '打', '每', '评',
               '少', '算', '又', '因', '情', '找', '些', '份', '置', '适',
               '什', '蛋', '师', '气', '你', '姐', '棒', '试', '总', '定',
               '啊', '足', '级', '整', '带', '虾', '如', '态', '且', '尝',
               '主', '话', '强', '当', '更', '板', '知', '己', '无', '酸',
               '让', '入', '啦', '式', '笑', '赞', '片', '酱', '差', '像',
               '提', '队', '走', '嫩', '才', '刚', '午', '接', '重', '串',
               '回', '晚', '微', '周', '值', '费', '性', '桌', '拍', '跟',
               '块', '调', '糕'
               ]
    # 然后我们创建一个font_name的字典，用来装字体编码和 --> 所对应的数字、汉字
    font_name_dish = {}
    for index,value in enumerate(text_d):
        # 这就是大众点评乱码的结构：由前面的三个字符‘&#x’+后面是小写字母和数字+分号‘；’
        h = font_names_d[index].replace('uni', '&#x').lower() + ';'
        # 下面生成的这个就是乱码，他就对应刚刚字体文件的对应数字，可以运行看看
        font_name_dish[h] = value

    return font_name_dish

if __name__ == '__main__':
    font_name_tel = get_fonttel()
    font_name_time = get_fonttime()
    font_name_hour = get_fonthour()
    font_name_dish = get_fontdish()
    get_Shopdetails(font_name_tel,font_name_time,font_name_dish)